/*********************************************************
10人の学生のテスト点数（0〜100点）を配列に読み込み、以下の3つの値を算出するプログラムを作成しなさい。
平均点（実数で表示）
最高点
最低点
**********************************************************/
#include <iostream>
#include <cmath>
using namespace std;

int main() {
    // ここに回答を記述
    int mat[3][4];
    for(int i=0;i<3;i++){
        for(int j=0;j<4;j++){
            cin >> mat[i][j];
        }
    }
    cout<<mat[0][0]+mat[1][0]+mat[2][0]<<" "<<mat[0][1]+mat[1][1]+mat[2][1]<<" "<<mat[0][2]+mat[1][2]+mat[2][2]<<" "<<mat[0][3]+mat[1][3]+mat[2][3];
    return 0;
}