/*********************************************************
プログラミング概論 1（第 1 中間試験）：問 3
   学籍番号：X X23 X XXX 氏名 XXXXXX
   提出日：2026 年 5 月 19 日
**********************************************************/
#include <iostream>
using namespace std;

int main() {
    int mat[4][4]; // 4x4に修正
    for(int i=0; i<4; i++) {
        for(int j=0; j<4; j++) { cin >> mat[i][j]; }
    }

    for(int i=0; i<4; i++) {
        for(int j=0; j<4; j++) {
            // 三項演算子を使って1行で条件分岐とスペース処理を行う
            cout << (i == j ? 0 : mat[i][j]) << (j == 3 ? "" : " ");
        }
        cout << endl;
    }
    return 0;
}